how_to_get = {
    "Славське": """<b>Як доїхати до Славського:</b>\nПотяги в сторону Ужгорода, зупинка ст. Славсько. Автобусом Львів - Славське, Стрий-Славське. Власним транспортом по трасі Київ — Чоп до повороту в м. Сколе на Славське. Славське знаходиться за 135 км від Львова та за 25 км від Сколе,680 км від Київа.""",
    "Драгобрат": """<b>Як доїхати до Славського:</b>\nДорога на Драгобрат починається в Ясіні. До села можна добратися автобусами з Івано-Франківська, Яремчі, Рахова, Ужгорода або поїздом Київ-Рахів, Одеса- Рахів, Харків-Рахів, Львів-Рахів. Як варіант - поїздами до Яремчі, Ворохти або до Івано-Франківська. Далі автобусом до Ясіні, або зомовити трансфер до Ясиня.\nЗ смт. Ясіня до курорту Драгобрат можна дібратися тільки на повнопривідному транспорті, який потрібно замовити наперед у місцевих жителів. Їх стоянка знаходиться біля АЗС Sun Oil (вул. Миру 148). На автостоянці поруч можна залишити свої власні авто за помірну ціну, де їх охоронятимуть. Тут ведеться відеоспостереження. Звідси можна піднятися до полонини Драгобрат (12 км) до готелів курорту та гірсько-лижних підйомників. Так само прохідні таксі доставляють туристів у зворотному до Ясіня напрямку.""",
    "Буковель": """""",
    "Пилипець": """""",
    "Плай": """""",
    "Яблуниця": """""",
    "Красія": """""",
    "Мигове": """""",
    "Яремче": """"""
}

trains_urls = {
    "Славське": "https://uz.gov.ua/passengers/timetable/?station=23091&by_station=%D0%9F%D0%BE%D1%88%D1%83%D0%BA",
    "Драгобрат": "https://uz.gov.ua/passengers/timetable/?station=23213&by_station=%D0%9F%D0%BE%D1%88%D1%83%D0%BA",
    "Буковель": """""",
    "Пилипець": """""",
    "Плай": """""",
    "Яблуниця": """""",
    "Красія": """""",
    "Мигове": """""",
    "Яремче": """"""
}