except_key_error_text = 'Щось тут не так, можливо ти не обрав місце для катки 🤨\n<b>Спробуй ще разочок</b>'
unknown_command_text = 'Ох, я щось не вкатую про що ти 🤔\n' \
                       'Якщо маєш зауваження чи пропозиції пиши на: <b><i>mail@admin.com</i></b>\n' \
                       'Або обирай курорт і вперед до нових вершин'

welcome_text = 'Привіт, <b>{first_name} {last_name}!</b> Mаю на меті допомоги тобі визначитись ' \
               'де катати в цьому році 🏂\n️\n️<b>Тисни на курорт і обирай, що цікавить </b> 🏔'

choose_resort_text = 'А я катав {resort}, неперевершено!\n<b>Про що розповісти?</b>'

hotels_info_text = '<b>Ось інформація по житлу у {resort}.</b>'

# hotels_info_text = '<b>Шукаю інфо по житлу у {resort}.</b>\nА поки я обробляю для тебе інформацію поміркуй... ' \
#                    'Хто краще, сноубордист чи лижник 😉'

hotels_price_text = 'Середня вартість проживання (1 ніч на 2 особи) у {resort} складає: ' \
                    '{average} грн.\n\nМінімальна ціна з рекомендованих - {min} грн. Максимальна - {max} грн.'

fish_text = 'Ця інфа по {resort} буде доступна, як тільки відбудеться старт сезону! ' \
            'Знаю, у мене вже теж ноги сверблять, потерпи поки випаде сніг і ми запизд*чимо окупантів!'

how_to_get_text = 'Тицяй, щоб подивитися, як доїхати до {resort} ⬇️'

web_cam_text = 'Доступ до веб-камер {resort} надає портал <b><i>snih.info</i></b>.\nМерщій тицькай на кнопку ⬇️'

food_global_text = '<b>Де поїсти у {resort}:</b>\nЄ безліч варіантів де можна перекусити або наїстися від пуза 🍽\n' \
                  'Обов`язково спробуй місцеву кухню прямо на схилі - <i>шашличок, бараболя з салом, борщик, бограч, ' \
                  'банош, місцеві автентичні напої</i> 😜, це настільки колоритно та атмосферно, що навіть ' \
                  'важко описати 🤤\nАле є не менш колоритні заклади, з не менш смачними стравами, лови деякі з них:\n\n'

food_individual_text = 'У {resort} не так добре розвинені звичні нам фуд-поінти на схилах, як на "диких" курортах.\n' \
                       'Проте є не менш смачні страви, в не менш автентичній атмосфері, мерщій переходь за посиланням 🤤'
